Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR35_DFP/2.1.55/edc/ATSAMR35J16B.PIC
      <edc:SFRDef edc:_addr="0x42003014" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATABUF0" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATABUF" edc:desc="DAC0 Data Buffer" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003016" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATABUF1" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATABUF" edc:desc="DAC0 Data Buffer" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003018" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003019" edc:offset="0x3E7"/>
      <edc:SFRDef edc:_addr="0x42003400" edc:access="------------nnnn-nnnnnnnnnnnnnnn" edc:cname="CTRLA" edc:impl="0xF7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AESMODE" edc:desc="AES Modes of operation" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="CFBS" edc:desc="CFB Types" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="KEYSIZE" edc:desc="Keysize" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CIPHER" edc:desc="Cipher mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTMODE" edc:desc="Start mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOD" edc:desc="LOD Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEYGEN" edc:desc="Last key generation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XORKEY" edc:desc="Xor Key operation" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CTYPE" edc:desc="Counter measure types" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003404" edc:access="----nnnn" edc:cname="CTRLB" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Manual Start" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NEWMSG" edc:desc="New message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOM" edc:desc="End of message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMUL" edc:desc="GF Multiplication" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003405" edc:access="------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ENCCMP" edc:desc="Encryption Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMCMP" edc:desc="GF Multiplication Complete" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003406" edc:access="------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ENCCMP" edc:desc="Encryption Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMCMP" edc:desc="GF Multiplication Complete" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003407" edc:access="------nn" edc:cname="INTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ENCCMP" edc:desc="Encryption Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMCMP" edc:desc="GF Multiplication Complete" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003408" edc:access="------nn" edc:cname="DATABUFPTR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="INDATAPTR" edc:desc="Input Data Pointer" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003409" edc:access="-------w" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200340A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4200340C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003410" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003414" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003418" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x4200341C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD4" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003420" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003424" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003428" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:AdjustPoint edc:_addr="0x4200342C" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x42003438" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INDATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x4200343C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="INTVECTV0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003440" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="INTVECTV1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003444" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="INTVECTV2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003448" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="INTVECTV3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:AdjustPoint edc:_addr="0x4200344C" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x4200345C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HASHKEY0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003460" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HASHKEY1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003464" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HASHKEY2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003468" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HASHKEY3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x4200346C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GHASH0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003470" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GHASH1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003474" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GHASH2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003478" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GHASH3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:AdjustPoint edc:_addr="0x4200347C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x42003480" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CIPLEN" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42003484" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RANDSEED" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:AdjustPoint edc:_addr="0x42003488" edc:offset="0x378"/>
      <edc:SFRDef edc:_addr="0x42003800" edc:access="-n----n-" edc:cname="CTRLA" edc:impl="0x42" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRNG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003801" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42003804" edc:access="-------n" edc:cname="EVCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRNG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATARDYEO" edc:desc="Data Ready Event Output" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
